/****************************************************
 * sysjul.c 2007.11.2 by ylh
 * 这部分内容与操作系统有关，适于unix类系统。有效的时间范围是
 * 1970.1.1 00:00:00 -- 2038.1.19
 * 应根据不同的操作系统修改
 ****************************************************/
#include <sys/time.h>
#include <datejul.h>

/************************************************************************/
/*function:rtoday 取出当日的准儒略历(距离1899.12.31)的天数                              */
/************************************************************************/

INT4 rtoday() /* 返回本地时间的日期 */
{
time_t tim;
	time(&tim);
	tim = (tim - timezone)/86400+25568;
	return tim;
}
/* 以下都是返回greenwith时刻 */
/************************************************************************/
/*function:now_minuts 取出当日的准儒略历(距离1899.12.31 0:0)的分钟数         */
/************************************************************************/

INT4 now_minuts()
{
time_t tim;
	time(&tim);
	tim/=60;
	tim += 36817920;
	return (INT4)tim;
}
/************************************************************************/
/*function:now_sec 取出当日的准儒略历(距离1899.12.31 0:0:0)的秒数                       */
/************************************************************************/

INT64 now_sec()
{
time_t tim;
INT64 sec;
	time(&tim);
	sec=(INT64)tim+2209075200ll;
	return sec;
}
/*function:now_usec 取出当日的准儒略历(距离1899.12.31 0:0:0.000000)的微秒数 */
INT64 now_usec()
{
struct timeval tv;
INT64 tm;
	gettimeofday(&tv,0);
	tm=(INT64)tv.tv_sec + 2209075200ll;
	return tm * 1000000 + tv.tv_usec;
}

